#1) ახსენე კომენტარებით რა არის tuple და რა განსხვავებაა მასსა და list-ს შორის
#ის არის იგოვე ლისტი მაგრამ არ შეგვიძლია მისი შცვლა ანუ არშეგვიძლია მასში დავამატოთ,ამოვიღოთ ან ჩავანაცვლოთ რაიმე ველიუები
#2) შექმენი tuple, სადაც იქნება 3 ელემენტი: სახელი, ასაკი და ქალაქი
tuple=("lado","nizharadze","londoni")
#3) გამოიტანე tuple-ის პირველი ელემენტი კონსოლში (ან print-ით)
print(tuple)
#4) სცადე tuple-ის რომელიმე ელემენტის შეცვლა და დააკვირდი რა მოხდება
#არშეიცვლება
#5) შექმენი tuple 5 რიცხვით და გამოიტანე მისი სიგრძე (length / len)
tuple2=(1,3,4,6,7)
print(len(tuple2))