#1
my_tuple = (10, 20, 30, 40, 50)
first_two = my_tuple[:2]
print(first_two)

#2
numbers = (2, 56, 99, 22, 15, 23, 66, 11, 134, 23, 66, 91, 22, 2, 23)
count_23 = numbers.count(23)
print("23 appears:", count_23, "times")

#3
aura = (10, 25, 5, 80, 70, 20)
for number in aura:
    if number > 10:
        print(number)
#4
# List და Tuple სხვადასხვა მონაცემთა სტრუქტურებია. ძირითადი განსხვავებები:
# 1. List mutable (მოდიფიცირებადი) ტიპია, ანუ მასში ელემენტების დამატება, წაშლა ან ცვლილება შეიძლება.
#    მაგალითად: my_list.append(30)
# 2. Tuple immutable (შეიცვალებადი არა) ტიპია, ანუ მისი ელემენტების შეცვლა ან წაშლა არ შეიძლება.
#    tuple-ს ელემენტებს ვერ შეცვლით ან დაამატებთ ახალ ელემენტებს.
# 3. List-ი ყოველთვის უფრო მეტად გონივრულია, როდესაც საჭიროა ელემენტების ხშირად შეცვლა.
# 4. Tuple-ი უფრო სწრაფია და ნაკლები მეხსიერებას მოიხმარს, რადგან ის immutable ტიპია.

#5
# Immutable ნიშნავს, რომ ობიექტის მნიშვნელობა აღარ შეიძლება შეიცვალოს მას შემდეგ, რაც ის შეიქმნება.
# ანუ, mutable ტიპებისგან განსხვავებით, მათი მონაცემები არ შეიცვლება.

# Mutable ტიპები: 
# - List, Dictionary, Set. 
# - მათი მონაცემები შეიძლება შეიცვალოს. მაგალითად: 
#   my_list.append(5)

# Immutable ტიპები:
# - Tuple, String, Integer. 
# - მათ ვერ შევცვლით ცვლადი ელემენტების მეშვეობით. მაგალითად:
#   my_tuple[0] = 10 (ეს შეცდომას გამოიწვევს)
